app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "product_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Life"], ["price", "21.00"], ["product_type_id", 6], ["created_at", "2016-08-06 07:21:44.667983"], ["updated_at", "2016-08-06 07:21:44.667983"]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "properties" = $1, "updated_at" = $2 WHERE "products"."id" = $3