app/controllers/product_types_controller.rb

SELECT "product_types".* FROM "product_types"
---
  def index
    @product_types = ProductType.all

INSERT INTO "product_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Book"], ["created_at", "2016-08-06 06:05:28.556475"], ["updated_at", "2016-08-06 06:05:28.556475"]]
---
  def create
    @product_type = ProductType.new(product_type_params)

    respond_to do |format|
      if @product_type.save

UPDATE "product_types" SET "name" = $1, "updated_at" = $2 WHERE "product_types"."id" = $3  [["name", "Book"], ["updated_at", "2016-08-06 06:37:33.221099"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product_type.update(product_type_params)

DELETE FROM "product_types" WHERE "product_types"."id" = $1  [["id", 1]]
---
  def destroy
    @product_type.destroy

SELECT  "product_types".* FROM "product_types" WHERE "product_types"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_product_type
      @product_type = ProductType.find(params[:id])