app/views/products/index.html.erb

SELECT "product_types".* FROM "product_types"
---
<%= form_tag new_product_path, method: :get do %>
  <%= select_tag :product_type_id, options_from_collection_for_select(ProductType.all, :id, :name) %>